Model: "model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 240, 416, 3)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 240, 416, 64)      9472      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 120, 208, 64)      0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 120, 208, 32)      51232     
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 120, 208, 16)      4624      
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 120, 208, 3)       435       
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 120, 208, 16)      448       
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 120, 208, 32)      12832     
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 240, 416, 1)       33        
_________________________________________________________________
conv2d_transpose_9 (Conv2DTr (None, 240, 416, 64)      3200      
_________________________________________________________________
conv2d_transpose_10 (Conv2DT (None, 240, 416, 3)       1731      
=================================================================
Total params: 84,007
Trainable params: 84,007
Non-trainable params: 0
_________________________________________________________________
