Model: "model_13"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_13 (InputLayer)        (None, 240, 416, 3)       0         
_________________________________________________________________
conv2d_51 (Conv2D)           (None, 120, 208, 64)      9472      
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 60, 104, 64)       0         
_________________________________________________________________
conv2d_52 (Conv2D)           (None, 60, 104, 32)       51232     
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 30, 52, 32)        0         
_________________________________________________________________
conv2d_53 (Conv2D)           (None, 30, 52, 16)        4624      
_________________________________________________________________
conv2d_54 (Conv2D)           (None, 30, 52, 3)         435       
_________________________________________________________________
conv2d_transpose_72 (Conv2DT (None, 30, 52, 16)        448       
_________________________________________________________________
conv2d_transpose_73 (Conv2DT (None, 60, 104, 1)        17        
_________________________________________________________________
conv2d_transpose_74 (Conv2DT (None, 60, 104, 32)       832       
_________________________________________________________________
conv2d_transpose_75 (Conv2DT (None, 120, 208, 1)       33        
_________________________________________________________________
conv2d_transpose_76 (Conv2DT (None, 120, 208, 64)      3200      
_________________________________________________________________
conv2d_transpose_77 (Conv2DT (None, 240, 416, 3)       1731      
=================================================================
Total params: 72,024
Trainable params: 72,024
Non-trainable params: 0
_________________________________________________________________
