Model: "model_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         (None, 240, 416, 3)       0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 240, 416, 64)      9472      
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 120, 416, 64)      0         
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 120, 416, 32)      51232     
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 60, 208, 32)       0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 60, 208, 16)       4624      
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 30, 104, 16)       0         
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 30, 104, 3)        435       
_________________________________________________________________
conv2d_transpose_23 (Conv2DT (None, 60, 208, 1)        4         
_________________________________________________________________
conv2d_transpose_24 (Conv2DT (None, 60, 208, 16)       160       
_________________________________________________________________
conv2d_transpose_25 (Conv2DT (None, 120, 416, 1)       17        
_________________________________________________________________
conv2d_transpose_26 (Conv2DT (None, 120, 416, 32)      832       
_________________________________________________________________
conv2d_transpose_27 (Conv2DT (None, 240, 416, 1)       33        
_________________________________________________________________
conv2d_transpose_28 (Conv2DT (None, 240, 416, 64)      3200      
_________________________________________________________________
conv2d_transpose_29 (Conv2DT (None, 240, 416, 3)       1731      
=================================================================
Total params: 71,740
Trainable params: 71,740
Non-trainable params: 0
_________________________________________________________________
