Model: "model_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_6 (InputLayer)         (None, 240, 416, 3)       0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 120, 208, 64)      9472      
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 120, 208, 32)      51232     
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 120, 208, 16)      4624      
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 120, 208, 3)       435       
_________________________________________________________________
conv2d_transpose_32 (Conv2DT (None, 120, 208, 16)      448       
_________________________________________________________________
conv2d_transpose_33 (Conv2DT (None, 120, 208, 32)      12832     
_________________________________________________________________
conv2d_transpose_34 (Conv2DT (None, 120, 208, 64)      100416    
_________________________________________________________________
conv2d_transpose_35 (Conv2DT (None, 240, 416, 3)       1731      
=================================================================
Total params: 181,190
Trainable params: 181,190
Non-trainable params: 0
_________________________________________________________________
