Model: "model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 240, 416, 3)       0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 120, 208, 64)      9472      
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 120, 208, 32)      51232     
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 120, 208, 16)      4624      
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 120, 208, 8)       1160      
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 120, 208, 3)       219       
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 120, 208, 8)       224       
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 120, 208, 16)      1168      
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 120, 208, 32)      12832     
_________________________________________________________________
conv2d_transpose_9 (Conv2DTr (None, 120, 208, 64)      100416    
_________________________________________________________________
conv2d_transpose_10 (Conv2DT (None, 240, 416, 3)       1731      
=================================================================
Total params: 183,078
Trainable params: 183,078
Non-trainable params: 0
_________________________________________________________________
