Model: "model_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_11 (InputLayer)        (None, 240, 416, 3)       0         
_________________________________________________________________
conv2d_43 (Conv2D)           (None, 120, 208, 64)      9472      
_________________________________________________________________
conv2d_44 (Conv2D)           (None, 120, 208, 32)      51232     
_________________________________________________________________
conv2d_45 (Conv2D)           (None, 120, 208, 16)      4624      
_________________________________________________________________
conv2d_46 (Conv2D)           (None, 120, 208, 3)       435       
_________________________________________________________________
conv2d_transpose_63 (Conv2DT (None, 120, 208, 16)      448       
_________________________________________________________________
conv2d_transpose_64 (Conv2DT (None, 120, 208, 32)      12832     
_________________________________________________________________
conv2d_transpose_65 (Conv2DT (None, 120, 208, 64)      100416    
_________________________________________________________________
conv2d_transpose_66 (Conv2DT (None, 240, 416, 3)       1731      
=================================================================
Total params: 181,190
Trainable params: 181,190
Non-trainable params: 0
_________________________________________________________________
