Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 480, 832, 3)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 240, 416, 64)      9472      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 240, 416, 32)      51232     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 240, 416, 16)      4624      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 240, 416, 3)       435       
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 240, 416, 16)      448       
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 240, 416, 32)      12832     
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 240, 416, 64)      100416    
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 480, 832, 3)       1731      
=================================================================
Total params: 181,190
Trainable params: 181,190
Non-trainable params: 0
_________________________________________________________________
