Model: "model_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         (None, 240, 416, 3)       0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 120, 416, 64)      9472      
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 120, 416, 32)      51232     
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 120, 416, 16)      4624      
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 120, 416, 3)       435       
_________________________________________________________________
conv2d_transpose_22 (Conv2DT (None, 120, 416, 16)      448       
_________________________________________________________________
conv2d_transpose_23 (Conv2DT (None, 120, 416, 32)      12832     
_________________________________________________________________
conv2d_transpose_24 (Conv2DT (None, 120, 416, 64)      100416    
_________________________________________________________________
conv2d_transpose_25 (Conv2DT (None, 240, 416, 3)       1731      
=================================================================
Total params: 181,190
Trainable params: 181,190
Non-trainable params: 0
_________________________________________________________________
