Model: "model_12"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_12 (InputLayer)        (None, 240, 416, 3)       0         
_________________________________________________________________
conv2d_47 (Conv2D)           (None, 120, 208, 64)      9472      
_________________________________________________________________
max_pooling2d_21 (MaxPooling (None, 60, 104, 64)       0         
_________________________________________________________________
conv2d_48 (Conv2D)           (None, 60, 104, 32)       51232     
_________________________________________________________________
conv2d_49 (Conv2D)           (None, 60, 104, 16)       4624      
_________________________________________________________________
conv2d_50 (Conv2D)           (None, 60, 104, 3)        435       
_________________________________________________________________
conv2d_transpose_67 (Conv2DT (None, 60, 104, 16)       448       
_________________________________________________________________
conv2d_transpose_68 (Conv2DT (None, 60, 104, 32)       12832     
_________________________________________________________________
conv2d_transpose_69 (Conv2DT (None, 120, 208, 1)       33        
_________________________________________________________________
conv2d_transpose_70 (Conv2DT (None, 120, 208, 64)      3200      
_________________________________________________________________
conv2d_transpose_71 (Conv2DT (None, 240, 416, 3)       1731      
=================================================================
Total params: 84,007
Trainable params: 84,007
Non-trainable params: 0
_________________________________________________________________
