Model: "model_19"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_19 (InputLayer)        (None, 240, 416, 3)       0         
_________________________________________________________________
conv2d_74 (Conv2D)           (None, 120, 208, 64)      9472      
_________________________________________________________________
conv2d_75 (Conv2D)           (None, 60, 104, 32)       51232     
_________________________________________________________________
conv2d_76 (Conv2D)           (None, 60, 104, 16)       4624      
_________________________________________________________________
conv2d_77 (Conv2D)           (None, 60, 104, 3)        435       
_________________________________________________________________
conv2d_transpose_91 (Conv2DT (None, 60, 104, 16)       448       
_________________________________________________________________
conv2d_transpose_92 (Conv2DT (None, 60, 104, 32)       12832     
_________________________________________________________________
conv2d_transpose_93 (Conv2DT (None, 120, 208, 64)      100416    
_________________________________________________________________
conv2d_transpose_94 (Conv2DT (None, 240, 416, 3)       1731      
=================================================================
Total params: 181,190
Trainable params: 181,190
Non-trainable params: 0
_________________________________________________________________
