Model: "model_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_9 (InputLayer)         (None, 240, 416, 3)       0         
_________________________________________________________________
conv2d_33 (Conv2D)           (None, 240, 416, 64)      9472      
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 120, 208, 64)      0         
_________________________________________________________________
conv2d_34 (Conv2D)           (None, 120, 208, 32)      51232     
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 60, 104, 32)       0         
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 60, 104, 16)       4624      
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 60, 104, 3)        435       
_________________________________________________________________
conv2d_transpose_46 (Conv2DT (None, 60, 104, 16)       448       
_________________________________________________________________
conv2d_transpose_47 (Conv2DT (None, 120, 208, 1)       17        
_________________________________________________________________
conv2d_transpose_48 (Conv2DT (None, 120, 208, 32)      832       
_________________________________________________________________
conv2d_transpose_49 (Conv2DT (None, 240, 416, 1)       33        
_________________________________________________________________
conv2d_transpose_50 (Conv2DT (None, 240, 416, 64)      3200      
_________________________________________________________________
conv2d_transpose_51 (Conv2DT (None, 240, 416, 3)       1731      
=================================================================
Total params: 72,024
Trainable params: 72,024
Non-trainable params: 0
_________________________________________________________________
