Model: "model_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_15 (InputLayer)        (None, 256, 416, 3)       0         
_________________________________________________________________
conv2d_59 (Conv2D)           (None, 128, 208, 64)      9472      
_________________________________________________________________
max_pooling2d_27 (MaxPooling (None, 64, 104, 64)       0         
_________________________________________________________________
conv2d_60 (Conv2D)           (None, 64, 104, 32)       51232     
_________________________________________________________________
max_pooling2d_28 (MaxPooling (None, 32, 52, 32)        0         
_________________________________________________________________
conv2d_61 (Conv2D)           (None, 32, 52, 16)        4624      
_________________________________________________________________
max_pooling2d_29 (MaxPooling (None, 16, 26, 16)        0         
_________________________________________________________________
conv2d_62 (Conv2D)           (None, 16, 26, 8)         1160      
_________________________________________________________________
max_pooling2d_30 (MaxPooling (None, 8, 13, 8)          0         
_________________________________________________________________
conv2d_63 (Conv2D)           (None, 8, 13, 3)          219       
_________________________________________________________________
conv2d_transpose_85 (Conv2DT (None, 16, 26, 1)         4         
_________________________________________________________________
conv2d_transpose_86 (Conv2DT (None, 16, 26, 8)         80        
_________________________________________________________________
conv2d_transpose_87 (Conv2DT (None, 32, 52, 1)         9         
_________________________________________________________________
conv2d_transpose_88 (Conv2DT (None, 32, 52, 16)        160       
_________________________________________________________________
conv2d_transpose_89 (Conv2DT (None, 64, 104, 1)        17        
_________________________________________________________________
conv2d_transpose_90 (Conv2DT (None, 64, 104, 32)       832       
_________________________________________________________________
conv2d_transpose_91 (Conv2DT (None, 128, 208, 1)       33        
_________________________________________________________________
conv2d_transpose_92 (Conv2DT (None, 128, 208, 64)      3200      
_________________________________________________________________
conv2d_transpose_93 (Conv2DT (None, 256, 416, 3)       1731      
=================================================================
Total params: 72,773
Trainable params: 72,773
Non-trainable params: 0
_________________________________________________________________
