Model: "model_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         (None, 480, 832, 3)       0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 240, 416, 64)      9472      
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 120, 208, 64)      0         
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 120, 208, 32)      51232     
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 60, 104, 32)       0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 60, 104, 16)       4624      
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 30, 52, 16)        0         
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 30, 52, 8)         1160      
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 15, 26, 8)         0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 15, 26, 3)         219       
_________________________________________________________________
conv2d_transpose_23 (Conv2DT (None, 30, 52, 1)         4         
_________________________________________________________________
conv2d_transpose_24 (Conv2DT (None, 30, 52, 8)         80        
_________________________________________________________________
conv2d_transpose_25 (Conv2DT (None, 60, 104, 1)        9         
_________________________________________________________________
conv2d_transpose_26 (Conv2DT (None, 60, 104, 16)       160       
_________________________________________________________________
conv2d_transpose_27 (Conv2DT (None, 120, 208, 1)       17        
_________________________________________________________________
conv2d_transpose_28 (Conv2DT (None, 120, 208, 32)      832       
_________________________________________________________________
conv2d_transpose_29 (Conv2DT (None, 240, 416, 1)       33        
_________________________________________________________________
conv2d_transpose_30 (Conv2DT (None, 240, 416, 64)      3200      
_________________________________________________________________
conv2d_transpose_31 (Conv2DT (None, 480, 832, 3)       1731      
=================================================================
Total params: 72,773
Trainable params: 72,773
Non-trainable params: 0
_________________________________________________________________
