Model: "model_18"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_18 (InputLayer)        (None, 240, 416, 3)       0         
_________________________________________________________________
conv2d_70 (Conv2D)           (None, 120, 416, 64)      9472      
_________________________________________________________________
conv2d_71 (Conv2D)           (None, 60, 208, 32)       51232     
_________________________________________________________________
conv2d_72 (Conv2D)           (None, 60, 208, 16)       4624      
_________________________________________________________________
conv2d_73 (Conv2D)           (None, 60, 208, 3)        435       
_________________________________________________________________
conv2d_transpose_87 (Conv2DT (None, 60, 208, 16)       448       
_________________________________________________________________
conv2d_transpose_88 (Conv2DT (None, 60, 208, 32)       12832     
_________________________________________________________________
conv2d_transpose_89 (Conv2DT (None, 120, 416, 64)      100416    
_________________________________________________________________
conv2d_transpose_90 (Conv2DT (None, 240, 416, 3)       1731      
=================================================================
Total params: 181,190
Trainable params: 181,190
Non-trainable params: 0
_________________________________________________________________
