Model: "model_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 480, 832, 3)       0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 240, 416, 64)      9472      
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 120, 208, 32)      51232     
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 60, 104, 16)       4624      
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 60, 104, 8)        1160      
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 60, 104, 3)        219       
_________________________________________________________________
conv2d_transpose_11 (Conv2DT (None, 60, 104, 8)        224       
_________________________________________________________________
conv2d_transpose_12 (Conv2DT (None, 60, 104, 16)       1168      
_________________________________________________________________
conv2d_transpose_13 (Conv2DT (None, 120, 208, 32)      12832     
_________________________________________________________________
conv2d_transpose_14 (Conv2DT (None, 240, 416, 64)      100416    
_________________________________________________________________
conv2d_transpose_15 (Conv2DT (None, 480, 832, 3)       1731      
=================================================================
Total params: 183,078
Trainable params: 183,078
Non-trainable params: 0
_________________________________________________________________
