Model: "model_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         (None, 480, 832, 3)       0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 480, 832, 64)      9472      
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 240, 416, 64)      0         
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 240, 416, 32)      51232     
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 240, 416, 16)      4624      
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 240, 416, 3)       435       
_________________________________________________________________
conv2d_transpose_27 (Conv2DT (None, 240, 416, 16)      448       
_________________________________________________________________
conv2d_transpose_28 (Conv2DT (None, 240, 416, 32)      12832     
_________________________________________________________________
conv2d_transpose_29 (Conv2DT (None, 480, 832, 1)       33        
_________________________________________________________________
conv2d_transpose_30 (Conv2DT (None, 480, 832, 64)      3200      
_________________________________________________________________
conv2d_transpose_31 (Conv2DT (None, 480, 832, 3)       1731      
=================================================================
Total params: 84,007
Trainable params: 84,007
Non-trainable params: 0
_________________________________________________________________
