Model: "model_14"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_14 (InputLayer)        (None, 240, 416, 3)       0         
_________________________________________________________________
conv2d_53 (Conv2D)           (None, 120, 208, 64)      9472      
_________________________________________________________________
conv2d_54 (Conv2D)           (None, 60, 104, 32)       51232     
_________________________________________________________________
conv2d_55 (Conv2D)           (None, 60, 104, 16)       4624      
_________________________________________________________________
conv2d_56 (Conv2D)           (None, 60, 104, 3)        435       
_________________________________________________________________
conv2d_transpose_71 (Conv2DT (None, 60, 104, 16)       448       
_________________________________________________________________
conv2d_transpose_72 (Conv2DT (None, 60, 104, 32)       12832     
_________________________________________________________________
conv2d_transpose_73 (Conv2DT (None, 120, 208, 64)      100416    
_________________________________________________________________
conv2d_transpose_74 (Conv2DT (None, 240, 416, 3)       1731      
=================================================================
Total params: 181,190
Trainable params: 181,190
Non-trainable params: 0
_________________________________________________________________
