Model: "model_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         (None, 240, 416, 3)       0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 240, 416, 64)      9472      
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 120, 208, 64)      0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 120, 208, 32)      51232     
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 60, 104, 32)       0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 60, 104, 16)       4624      
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 60, 104, 3)        435       
_________________________________________________________________
conv2d_transpose_17 (Conv2DT (None, 60, 104, 16)       448       
_________________________________________________________________
conv2d_transpose_18 (Conv2DT (None, 120, 208, 1)       17        
_________________________________________________________________
conv2d_transpose_19 (Conv2DT (None, 120, 208, 32)      832       
_________________________________________________________________
conv2d_transpose_20 (Conv2DT (None, 240, 416, 1)       33        
_________________________________________________________________
conv2d_transpose_21 (Conv2DT (None, 240, 416, 64)      3200      
_________________________________________________________________
conv2d_transpose_22 (Conv2DT (None, 240, 416, 3)       1731      
=================================================================
Total params: 72,024
Trainable params: 72,024
Non-trainable params: 0
_________________________________________________________________
