Model: "model_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_9 (InputLayer)         (None, 240, 416, 3)       0         
_________________________________________________________________
conv2d_34 (Conv2D)           (None, 120, 208, 64)      9472      
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 60, 104, 64)       0         
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 60, 104, 32)       51232     
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 30, 52, 32)        0         
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 30, 52, 16)        4624      
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 15, 26, 16)        0         
_________________________________________________________________
conv2d_37 (Conv2D)           (None, 15, 26, 3)         435       
_________________________________________________________________
conv2d_transpose_47 (Conv2DT (None, 30, 52, 1)         4         
_________________________________________________________________
conv2d_transpose_48 (Conv2DT (None, 30, 52, 16)        160       
_________________________________________________________________
conv2d_transpose_49 (Conv2DT (None, 60, 104, 1)        17        
_________________________________________________________________
conv2d_transpose_50 (Conv2DT (None, 60, 104, 32)       832       
_________________________________________________________________
conv2d_transpose_51 (Conv2DT (None, 120, 208, 1)       33        
_________________________________________________________________
conv2d_transpose_52 (Conv2DT (None, 120, 208, 64)      3200      
_________________________________________________________________
conv2d_transpose_53 (Conv2DT (None, 240, 416, 3)       1731      
=================================================================
Total params: 71,740
Trainable params: 71,740
Non-trainable params: 0
_________________________________________________________________
