Model: "model_14"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_14 (InputLayer)        (None, 240, 416, 3)       0         
_________________________________________________________________
conv2d_55 (Conv2D)           (None, 120, 208, 64)      9472      
_________________________________________________________________
max_pooling2d_24 (MaxPooling (None, 60, 104, 64)       0         
_________________________________________________________________
conv2d_56 (Conv2D)           (None, 60, 104, 32)       51232     
_________________________________________________________________
max_pooling2d_25 (MaxPooling (None, 30, 52, 32)        0         
_________________________________________________________________
conv2d_57 (Conv2D)           (None, 30, 52, 16)        4624      
_________________________________________________________________
max_pooling2d_26 (MaxPooling (None, 15, 26, 16)        0         
_________________________________________________________________
conv2d_58 (Conv2D)           (None, 15, 26, 3)         435       
_________________________________________________________________
conv2d_transpose_78 (Conv2DT (None, 30, 52, 1)         4         
_________________________________________________________________
conv2d_transpose_79 (Conv2DT (None, 30, 52, 16)        160       
_________________________________________________________________
conv2d_transpose_80 (Conv2DT (None, 60, 104, 1)        17        
_________________________________________________________________
conv2d_transpose_81 (Conv2DT (None, 60, 104, 32)       832       
_________________________________________________________________
conv2d_transpose_82 (Conv2DT (None, 120, 208, 1)       33        
_________________________________________________________________
conv2d_transpose_83 (Conv2DT (None, 120, 208, 64)      3200      
_________________________________________________________________
conv2d_transpose_84 (Conv2DT (None, 240, 416, 3)       1731      
=================================================================
Total params: 71,740
Trainable params: 71,740
Non-trainable params: 0
_________________________________________________________________
