Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 480, 832, 3)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 240, 832, 64)      9472      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 120, 416, 32)      51232     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 60, 208, 16)       4624      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 60, 208, 8)        1160      
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 60, 208, 3)        219       
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 60, 208, 16)       448       
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 120, 416, 32)      12832     
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 240, 832, 64)      100416    
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 480, 832, 3)       1731      
=================================================================
Total params: 182,134
Trainable params: 182,134
Non-trainable params: 0
_________________________________________________________________
