Model: "model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 480, 832, 3)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 480, 832, 64)      9472      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 240, 832, 64)      0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 240, 832, 32)      51232     
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 120, 416, 32)      0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 120, 416, 16)      4624      
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 60, 208, 16)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 60, 208, 3)        435       
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 120, 416, 1)       4         
_________________________________________________________________
conv2d_transpose_9 (Conv2DTr (None, 120, 416, 16)      160       
_________________________________________________________________
conv2d_transpose_10 (Conv2DT (None, 240, 832, 1)       17        
_________________________________________________________________
conv2d_transpose_11 (Conv2DT (None, 240, 832, 32)      832       
_________________________________________________________________
conv2d_transpose_12 (Conv2DT (None, 480, 832, 1)       33        
_________________________________________________________________
conv2d_transpose_13 (Conv2DT (None, 480, 832, 64)      3200      
_________________________________________________________________
conv2d_transpose_14 (Conv2DT (None, 480, 832, 3)       1731      
=================================================================
Total params: 71,740
Trainable params: 71,740
Non-trainable params: 0
_________________________________________________________________
