Model: "model_20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_20 (InputLayer)        (None, 240, 416, 3)       0         
_________________________________________________________________
conv2d_78 (Conv2D)           (None, 120, 416, 64)      9472      
_________________________________________________________________
conv2d_79 (Conv2D)           (None, 60, 208, 32)       51232     
_________________________________________________________________
conv2d_80 (Conv2D)           (None, 30, 104, 16)       4624      
_________________________________________________________________
conv2d_81 (Conv2D)           (None, 30, 104, 8)        1160      
_________________________________________________________________
conv2d_82 (Conv2D)           (None, 30, 104, 3)        219       
_________________________________________________________________
conv2d_transpose_95 (Conv2DT (None, 30, 104, 16)       448       
_________________________________________________________________
conv2d_transpose_96 (Conv2DT (None, 60, 208, 32)       12832     
_________________________________________________________________
conv2d_transpose_97 (Conv2DT (None, 120, 416, 64)      100416    
_________________________________________________________________
conv2d_transpose_98 (Conv2DT (None, 240, 416, 3)       1731      
=================================================================
Total params: 182,134
Trainable params: 182,134
Non-trainable params: 0
_________________________________________________________________
