Model: "model_13"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_13 (InputLayer)        (None, 240, 416, 3)       0         
_________________________________________________________________
conv2d_49 (Conv2D)           (None, 120, 416, 64)      9472      
_________________________________________________________________
conv2d_50 (Conv2D)           (None, 60, 208, 32)       51232     
_________________________________________________________________
conv2d_51 (Conv2D)           (None, 60, 208, 16)       4624      
_________________________________________________________________
conv2d_52 (Conv2D)           (None, 60, 208, 3)        435       
_________________________________________________________________
conv2d_transpose_67 (Conv2DT (None, 60, 208, 16)       448       
_________________________________________________________________
conv2d_transpose_68 (Conv2DT (None, 60, 208, 32)       12832     
_________________________________________________________________
conv2d_transpose_69 (Conv2DT (None, 120, 416, 64)      100416    
_________________________________________________________________
conv2d_transpose_70 (Conv2DT (None, 240, 416, 3)       1731      
=================================================================
Total params: 181,190
Trainable params: 181,190
Non-trainable params: 0
_________________________________________________________________
