Model: "model_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 240, 416, 3)       0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 240, 416, 64)      9472      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 120, 416, 64)      0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 120, 416, 32)      51232     
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 60, 208, 32)       0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 60, 208, 16)       4624      
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 60, 208, 3)        435       
_________________________________________________________________
conv2d_transpose_11 (Conv2DT (None, 60, 208, 16)       448       
_________________________________________________________________
conv2d_transpose_12 (Conv2DT (None, 120, 416, 1)       17        
_________________________________________________________________
conv2d_transpose_13 (Conv2DT (None, 120, 416, 32)      832       
_________________________________________________________________
conv2d_transpose_14 (Conv2DT (None, 240, 416, 1)       33        
_________________________________________________________________
conv2d_transpose_15 (Conv2DT (None, 240, 416, 64)      3200      
_________________________________________________________________
conv2d_transpose_16 (Conv2DT (None, 240, 416, 3)       1731      
=================================================================
Total params: 72,024
Trainable params: 72,024
Non-trainable params: 0
_________________________________________________________________
